Repository: IDLKZ/jankuier_back
Catalog: app/i18n/translations/*/LC_MESSAGES/messages.po
Languages: kk, ru

# checker_required_for_status_change
source: Checker is required for status change
kk: Мәртебені өзгерту үшін тексеруші қажет

source: Cannot delete accepted request
kk: Қабылданған сұранысты жою мүмкін емес

source: Student not found by ID
kk: Студент ID-мен табылмады

source: Academy group not found by ID
kk: Академиялық топ ID-мен табылмады

# request_to_academy_group_already_exists
source: Request to this academy group already exists
kk: Бұл академиялық топқа сұраныс әлдеқашан бар

# ticketon_single_show_fetch_error
source: Error fetching single show data
kk: Сеанс деректерін алу қатесі

# ticketon_show_id_required
source: Show ID is required
kk: Сеанс ID-сы қажет

# ticketon_invalid_show_id
source: Show ID must be a positive number
kk: Сеанс ID-сы оң сан болуы керек

# ticketon_shows_fetch_error
source: Error fetching shows data
kk: Сеанстар тізімін алу қатесі

# ticketon_parameters_required
source: Either city_tag or event_type is required
kk: city_tag немесе event_type көрсету қажет

# ticketon_invalid_event_type
source: Invalid event type
kk: Оқиға түрі жарамсыз

# ticketon_invalid_language
source: Invalid language code
kk: Тіл коды жарамсыз

# ticketon_invalid_with_param
source: Invalid value for with parameter
kk: with параметрінің мәні жарамсыз

# ticketon_level_fetch_error
source: Error fetching level data
kk: Зал деңгейінің деректерін алу қатесі

# ticketon_level_id_required
source: Level ID is required
kk: Деңгей ID-сы қажет

# ticketon_invalid_level_id
source: Level ID must be a positive number
kk: Деңгей ID-сы оң сан болуы керек

# ticketon_show_level_fetch_error
source: Error fetching show level data
kk: Сеанс үшін зал деңгейінің деректерін алу қатесі

source: Invalid signature
kk: Жарамсыз қолтаңба

source: Payment transaction not found
kk: Төлем транзакциясы табылмады

source: Payment transaction is not active
kk: Төлем транзакциясы белсенді емес

source: Ticketon order and payment transaction not found
kk: Ticketon тапсырысы мен төлем транзакциясы табылмады

source: Ticketon order not found
kk: Ticketon тапсырысы табылмады

source: Ticketon order is not active
kk: Ticketon тапсырысы белсенді емес

source: Payment transaction not updated
kk: Төлем транзакциясы жаңартылмады

source: Ticketon order is not paid
kk: Ticketon тапсырысы төленбеген

source: Ticketon order is not confirmed or cancelled
kk: Ticketon тапсырысы расталмаған немесе тоқтатылмаған

source: Ticketon order is already refunded
kk: Ticketon тапсырысы бойынша қайтарым әлдеқашан жасалған

# refund_still_processing
source: Refund is still processing
kk: Қайтарым әлі өңделуде

source: Ticketon order is already paid
kk: Ticketon тапсырысы әлдеқашан төленген

source: Ticketon order is expired
kk: Ticketon тапсырысының мерзімі өткен

source: Acquiring error, try again
kk: Эквайринг қатесі, қайтадан көріңіз

source: Ticketon order tickets not found
kk: Ticketon тапсырысының билеттері табылмады

source: Ticket not found
kk: Билет табылмады

# booking_request_required
source: Booking request is required
kk: Брондау сұрауы қажет

# email_required
source: Email is required
kk: Email көрсету қажет

# phone_required
source: Phone is required
kk: Телефон көрсету қажет

# sale_id_required
source: Sale ID is required
kk: Сату ID-сы қажет

source: Show not found
kk: Сеанс табылмады

source: Ticket sale error
kk: Билет сату қатесі

source: Code verified successfully
kk: Код сәтті расталды

source: Invalid verification code
kk: Растау коды жарамсыз

source: Verification code expired
kk: Растау кодының мерзімі өткен

source: No verification code found
kk: Растау коды табылмады

# verification_code_required
source: Verification code is required
kk: Растау коды қажет

# user_already_verified
source: User is already verified
kk: Пайдаланушы әлдеқашан расталған

# file_delete_error
source: Error deleting file
kk: Файлды жою кезінде қате

# file_update_error
source: Error updating file
kk: Файлды жаңарту кезінде қате

# file_read_error
source: Error reading file
kk: Файлды оқу кезінде қате
