Repository: IDLKZ/jankuier_back
Catalog: app/i18n/translations/*/LC_MESSAGES/messages.po
Languages: kk, ru

# internal_server_error
source: Internal Server Errors:
kk: Сервердің ішкі қатесі
ru: Внутренняя ошибка сервера

source: The next value already exists.
kk: Келесі мән бұрыннан бар
ru: Следующее значение уже существует

source: Bad Request
kk: Дұрыс емес сұраныс
ru: Некорректный запрос

source: Unauthorized
kk: Авторизацияланбаған
ru: Неавторизован

# forbidden
source: Access Forbidden
kk: Қатынауға тыйым салынған
ru: Доступ запрещён

source: Not found.
kk: Ресурс табылмады
ru: Ресурс не найден

source: Conflict Occurred
kk: Қақтығыс анықталды
ru: Обнаружен конфликт

# you_dont_have_access_to_club_or_it_is_not_verified_or_exists
source: You don't have access to the club, or it is not verified or does not exist.
kk: Сізде клубқа қол жеткізу жоқ, немесе клуб расталмаған не жоқ
ru: У вас нет доступа к клубу, либо он не существует или не подтверждён

# licence_not_found
source: License not found.
kk: Лицензия табылмады
ru: Лицензия не найдена

# licence_is_not_active
source: License is not active.
kk: Лицензия белсенді емес
ru: Лицензия неактивна

source: SMS sent successfully
kk: SMS сәтті жіберілді
ru: SMS успешно отправлено

source: SMS sending failed
kk: SMS жіберу қатесі
ru: Ошибка отправки SMS

source: SMS sending error
kk: SMS жіберу кезіндегі қате
ru: Ошибка при отправке SMS

# sms_verification_code_message
source: Your verification code: {code}. Do not share this code with anyone.
kk: Тіркеуді аяқтау үшін сіздің кодыңыз: {code}. Кодты ешкімге айтпаңыз.
ru: Ваш код для завершения регистрации: {code}. Никому не сообщайте код.

source: File is required
kk: Файл міндетті
ru: Файл обязателен

# academy_group_student_id_validation_error
source: ID must be a positive number
kk: ID оң сан болуы керек
ru: ID должен быть положительным числом

# academy_group_student_not_found
source: Student not found in group
kk: Топтағы студент табылмады
ru: Студент в группе не найден

source: Student not found
kk: Студент табылмады
ru: Студент не найден

source: Academy group application not found
kk: Академиялық топқа өтінім табылмады
ru: Заявка в академическую группу не найдена

# student_already_in_group
source: Student is already in this group
kk: Студент бұл топта бар
ru: Студент уже находится в данной группе

source: Academy material not found
kk: Академия материалы табылмады
ru: Материал академии не найден

# academy_group_not_belongs_to_academy
source: Group does not belong to academy
kk: Топ академияға жатпайды
ru: Группа не принадлежит академии

# academy_material_title_already_exists
source: Material with this title already exists
kk: Осы атаумен материал бұрыннан бар
ru: Материал с таким названием уже существует

source: Invalid ID
kk: Жарамсыз ID
ru: Неверный ID

# academy_material_id_validation_error
source: Material ID must be a positive number
kk: Материал ID-сы оң сан болуы керек
ru: ID материала должен быть положительным числом

source: Invalid old password
kk: Ескі пароль дұрыс емес
ru: Неверный старый пароль

# new_password_must_be_different
source: New password must be different from the old one
kk: Жаңа пароль ескісінен өзгеше болуы керек
ru: Новый пароль должен отличаться от старого

# username_doesnt_exist
source: User with this username does not exist
kk: Мұндай пайдаланушы аты жоқ
ru: Пользователь с таким именем не существует

# password_or_username_incorrect
source: Incorrect username or password
kk: Пайдаланушы аты немесе пароль дұрыс емес
ru: Неверное имя пользователя или пароль

source: Invalid token type
kk: Токен түрі жарамсыз
ru: Неверный тип токена

source: Country not found
kk: Ел табылмады
ru: Страна не найдена

source: Modification type not found by ID
kk: Модификация түрі ID-мен табылмады

source: Product not found by ID
kk: Өнім ID-мен табылмады

# you_already_have_application_for_this_licence
source: You already have an application for this license.
kk: Сізде осы лицензияға өтінім бар
ru: У вас уже есть заявка на эту лицензию

# first_status_not_found
source: Initial status not found.
kk: Бастапқы статус табылмады
ru: Первоначальный статус не найден

source: Access denied.
kk: Қатынау рұқсат етілмеді
ru: Доступ запрещён

source: Application not found.
kk: Өтінім табылмады
ru: Заявка не найдена

source: Application status is not correct.
kk: Өтінім статусы дұрыс емес
ru: Статус заявки некорректен

source: Application is not active.
kk: Өтінім белсенді емес
ru: Заявка неактивна

source: Application is not ready.
kk: Өтінім дайын емес
ru: Заявка не готова

source: Application step not updated.
kk: Өтінім кезеңі жаңартылмады
ru: Этап заявки не обновлён

# application_next_status_not_found
source: Next application status not found.
kk: Өтінімнің келесі статусы табылмады
ru: Следующий статус заявки не найден

source: Application not updated.
kk: Өтінім жаңартылмады
ru: Заявка не обновлена

source: Application step not created.
kk: Өтінім кезеңі құрылмады
ru: Этап заявки не создан

source: Application criteria not checked.
kk: Өтінім критерийлері тексерілмеді
ru: Критерии заявки не проверены

source: Application criteria not found.
kk: Өтінім критерийлері табылмады
ru: Критерии заявки не найдены

source: Application criteria is ready.
kk: Өтінім критерийлері дайын
ru: Критерии заявки готовы

source: Category document not found.
kk: Санат құжаты табылмады
ru: Документ категории не найден

# licence_requirement_not_found
source: License requirement not found.
kk: Лицензия талабы табылмады
ru: Требование по лицензии не найдено

source: Application criteria not ready.
kk: Өтінім критерийлері дайын емес
ru: Критерии заявки не готовы

source: Application criteria already passed.
kk: Өтінім критерийлері бұрыннан өтілген
ru: Критерии заявки уже пройдены

source: Category not found.
kk: Санат табылмады
ru: Категория не найдена

source: Invalid criteria state.
kk: Критерийдің дұрыс емес күйі
ru: Некорректное состояние критериев

source: Application not created.
kk: Өтінім құрылмады
ru: Заявка не создана

# licence_has_no_requirements
source: License has no requirements.
kk: Лицензияда талаптар жоқ
ru: У лицензии нет требований

source: Category IDs not created.
kk: Санат ID-лары құрылмады
ru: ID категорий не созданы

source: Application document not found.
kk: Өтінім құжаты табылмады
ru: Документ заявки не найден

source: Application document not updated.
kk: Өтінім құжаты жаңартылмады
ru: Документ заявки не обновлён

source: Application document already checked.
kk: Өтінім құжаты бұрыннан тексерілген
ru: Документ заявки уже проверен

source: Application document already exists.
kk: Өтінім құжаты бұрыннан бар
ru: Документ заявки уже существует

source: File not saved.
kk: Файл сақталмады
ru: Файл не сохранён

source: Application document not created.
kk: Өтінім құжаты құрылмады
ru: Документ заявки не создан

source: File not found
kk: Файл табылмады
ru: Файл не найден

# application_status_exists
source: Application status already exists.
kk: Өтінім статусы бұрыннан бар
ru: Статус заявки уже существует

source: Role not found by value.
kk: Рөл мәні бойынша табылмады
ru: Роль не найдена по значению

source: Token expired.
kk: Токеннің мерзімі өтті
ru: Срок действия токена истёк

source: User not found.
kk: Пайдаланушы табылмады
ru: Пользователь не найден

source: Data not ready.
kk: Деректер дайын емес
ru: Данные не готовы

source: Something went wrong.
kk: Бірдеңе қате болды
ru: Что-то пошло не так

source: Role not found.
kk: Рөл табылмады
ru: Роль не найдена

source: Role can't register.
kk: Рөлді тіркеу мүмкін емес
ru: Роль не может быть зарегистрирована

# email_exists
source: Email already exists.
kk: Email бұрыннан бар
ru: Email уже существует

# username_exists
source: Username already exists.
kk: Пайдаланушы аты бұрыннан бар
ru: Имя пользователя уже существует

# phone_exists
source: Phone number already exists.
kk: Телефон нөмірі бұрыннан бар
ru: Номер телефона уже существует

# iin_exists
source: IIN already exists.
kk: ЖСН бұрыннан бар
ru: ИИН уже существует

# user_role_doesnt_exists
source: User role does not exist.
kk: Пайдаланушы рөлі жоқ
ru: Роль пользователя не существует

source: User role is not satisfied.
kk: Пайдаланушы рөлі талаптарға сай емес
ru: Роль пользователя не удовлетворяет требованиям

source: Club parent not found by ID.
kk: Ата-клуб ID бойынша табылмады
ru: Родительский клуб не найден по ID

source: Club type not found by ID.
kk: Клуб түрі ID бойынша табылмады
ru: Тип клуба не найден по ID

source: Image not found by ID.
kk: Сурет ID бойынша табылмады
ru: Изображение не найдено по ID

source: Parent and child are equal.
kk: Ата мен бала бірдей
ru: Родитель и потомок совпадают

# the_next_relations_already_exists
source: The next relation already exists.
kk: Келесі байланыс бұрыннан бар
ru: Следующая связь уже существует

source: Club not found by ID.
kk: Клуб ID бойынша табылмады
ru: Клуб не найден по ID

source: Season not found.
kk: Маусым табылмады
ru: Сезон не найден

source: League not found.
kk: Лига табылмады
ru: Лига не найдена

source: Document not found.
kk: Құжат табылмады
ru: Документ не найден

source: Cannot delete system permission.
kk: Жүйелік рұқсатты жоюға болмайды
ru: Нельзя удалить системное разрешение

source: Cannot delete system role.
kk: Жүйелік рөлді жоюға болмайды
ru: Нельзя удалить системную роль

source: Role not found by ID.
kk: Рөл ID бойынша табылмады
ru: Роль не найдена по ID

source: Permission not found by ID.
kk: Рұқсат ID бойынша табылмады
ru: Разрешение не найдено по ID

source: Field not found.
kk: Өріс табылмады
ru: Поле не найдено

source: Field party not found.
kk: Алаң табылмады
ru: Площадка не найдена

source: Field party schedule settings not found.
kk: Алаң кестесінің параметрлері табылмады
ru: Настройки расписания площадки не найдены

# working_days_validation_error
source: Working days must be numbers from 1 to 7 (1-Monday, 7-Sunday).
kk: Жұмыс күндері 1-ден 7-ге дейінгі сандар болуы керек (1-Дүйсенбі, 7-Жексенбі)
ru: Рабочие дни должны быть числами от 1 до 7 (1-Понедельник, 7-Воскресенье)

# excluded_dates_format_error
source: Invalid date format in excluded dates. Use YYYY-MM-DD format.
kk: Ерекше күндердегі дата форматы дұрыс емес. ЖЖЖЖ-АА-КК форматын қолданыңыз
ru: Неверный формат даты в исключенных датах. Используйте формат ГГГГ-ММ-ДД

# active_dates_validation_error
source: Active start date must be earlier than active end date.
kk: Белсенділік басталу күні аяқталу күнінен ерте болуы керек
ru: Дата начала активности должна быть раньше даты окончания

# json_format_error
source: must be a JSON object or array.
kk: JSON объектісі немесе массив болуы керек
ru: должно быть JSON объектом или массивом

# json_object_error
source: Each element in {field_name} must be an object.
kk: {field_name} ішіндегі әрбір элемент объект болуы керек
ru: Каждый элемент в {field_name} должен быть объектом

# required_field_error
source: Field {field} is required in {field_name}.
kk: {field_name} ішінде {field} өрісі міндетті
ru: Поле {field} обязательно в {field_name}

# time_format_error
source: Invalid time format in {field_name}.{field}: {value}. Use HH:MM format.
kk: {field_name}.{field} ішіндегі уақыт форматы дұрыс емес: {value}. СС:ММ форматын қолданыңыз
ru: Неверный формат времени в {field_name}.{field}: {value}. Используйте формат ЧЧ:ММ

# price_format_error
source: Invalid price format: {price}.
kk: Баға форматы дұрыс емес: {price}
ru: Неверный формат цены: {price}

# negative_price_error
source: Price cannot be negative.
kk: Баға теріс бола алмайды
ru: Цена не может быть отрицательной

# session_minute_validation_error
source: Session duration must be a positive number.
kk: Сессия ұзақтығы оң сан болуы керек
ru: Длительность сессии должна быть положительным числом

# break_between_session_validation_error
source: Break between sessions cannot be negative.
kk: Сессиялар арасындағы үзіліс теріс бола алмайды
ru: Перерыв между сессиями не может быть отрицательным

# booked_limit_validation_error
source: Booking limit must be a positive number.
kk: Брондау шегі оң сан болуы керек
ru: Лимит бронирований должен быть положительным числом

# id_validation_error
source: Schedule settings ID must be a positive number.
kk: Кесте параметрлерінің ID-сы оң сан болуы керек
ru: ID настроек расписания должен быть положительным числом

source: Field party schedule not found.
kk: Алаң кестесі табылмады
ru: Расписание площадки не найдено

# schedule_id_validation_error
source: Schedule ID must be a positive number.
kk: Кесте ID-сы оң сан болуы керек
ru: ID расписания должен быть положительным числом

# time_period_validation_error
source: Start time must be earlier than end time.
kk: Басталу уақыты аяқталу уақытынан ерте болуы керек
ru: Время начала должно быть раньше времени окончания

# schedule_overlap_error
source: Time overlaps with existing schedule.
kk: Уақыт бар кестемен қиылысады
ru: Время пересекается с существующим расписанием

# price_validation_error
source: Price must be a positive number.
kk: Баға оң сан болуы керек
ru: Цена должна быть положительным числом

# schedule_already_booked_error
source: Schedule is already booked and cannot be changed.
kk: Кесте қазірдің өзінде брондалған және өзгертілмейді
ru: Расписание уже забронировано и не может быть изменено

# schedule_already_paid_error
source: Schedule is already paid and cannot be changed.
kk: Кесте қазірдің өзінде төленген және өзгертілмейді
ru: Расписание уже оплачено и не может быть изменено

# field_gallery_not_found
source: Field gallery image not found.
kk: Өріс галереясының суреті табылмады
ru: Изображение галереи поля не найдено

# gallery_id_validation_error
source: Gallery image ID must be a positive number.
kk: Галерея суретінің ID-сы оң сан болуы керек
ru: ID изображения галереи должен быть положительным числом

# duplicate_gallery_image_error
source: This image is already added to the gallery.
kk: Бұл сурет әлдеқашан галереяға қосылған
ru: Это изображение уже добавлено в галерею

# invalid_file_type_for_gallery
source: Unsupported file type for gallery. Only images are allowed.
kk: Галерея үшін қолдау көрсетілмейтін файл түрі. Тек суреттерге рұқсат етіледі
ru: Неподдерживаемый тип файла для галереи. Разрешены только изображения

source: Academy not found.
kk: Академия табылмады
ru: Академия не найдена

# academy_id_validation_error
source: Academy ID must be a positive number.
kk: Академия ID-сы оң сан болуы керек
ru: ID академии должен быть положительным числом

source: City not found.
kk: Қала табылмады
ru: Город не найден

# academy_value_already_exists
source: Academy with this value already exists.
kk: Бұл мәні бар академия қазірдің өзінде бар
ru: Академия с таким значением уже существует

# age_range_validation_error
source: Minimum age must be less than maximum age.
kk: Ең төменгі жас ең көп жастан кем болуы керек
ru: Минимальный возраст должен быть меньше максимального

# gender_validation_error
source: Gender must be: 0 (any), 1 (male) or 2 (female).
kk: Жынысы: 0 (кез келген), 1 (ер) немесе 2 (әйел) болуы керек
ru: Пол должен быть: 0 (любой), 1 (мужской) или 2 (женский)

# working_time_validation_error
source: Working time must be in JSON format.
kk: Жұмыс уақыты JSON форматында болуы керек
ru: Рабочее время должно быть в формате JSON

source: Invalid email format.
kk: Email форматы дұрыс емес
ru: Неверный формат email

source: Invalid phone format.
kk: Телефон форматы дұрыс емес
ru: Неверный формат телефона

# average_price_validation_error
source: Average price must be a positive number.
kk: Орташа баға оң сан болуы керек
ru: Средняя цена должна быть положительным числом

# training_time_validation_error
source: Training time must be a positive number.
kk: Жаттығу уақыты оң сан болуы керек
ru: Время тренировки должно быть положительным числом

source: Academy group not found.
kk: Академия тобы табылмады
ru: Группа академии не найдена

# academy_group_id_validation_error
source: Academy group ID must be a positive number.
kk: Академия тобының ID-сы оң сан болуы керек
ru: ID группы академии должен быть положительным числом

# academy_group_value_already_exists
source: Academy group with this value already exists.
kk: Бұл мәні бар академия тобы қазірдің өзінде бар
ru: Группа академии с таким значением уже существует

# academy_group_name_required
source: Academy group name is required.
kk: Академия тобының атауы міндетті
ru: Название группы академии обязательно

# group_space_validation_error
source: Booked space cannot exceed total capacity.
kk: Бос орындар жалпы сыйымдылықтан аспауы керек
ru: Занятые места не могут превышать общую вместимость

# price_per_validation_error
source: Price description is required when price is specified.
kk: Баға көрсетілген кезде баға сипаттамасы міндетті
ru: Описание цены обязательно при указании цены

# academy_group_cannot_update_recruiting
source: Cannot update recruiting status. There are active students in the group.
kk: Жинау мәртебесін өзгерту мүмкін емес. Топта белсенді студенттер бар
ru: Невозможно изменить статус набора. В группе есть активные студенты

# academy_group_cannot_delete
source: Cannot delete group. There are active students or schedules.
kk: Топты жою мүмкін емес. Белсенді студенттер немесе кесте бар
ru: Невозможно удалить группу. Есть активные студенты или расписания

source: Academy group schedule not found.
kk: Академия тобының кестесі табылмады
ru: Расписание группы академии не найдено

# academy_group_schedule_id_validation_error
source: Academy group schedule ID must be a positive number.
kk: Академия тобы кестесінің ID-сы оң сан болуы керек
ru: ID расписания группы академии должен быть положительным числом

# schedule_time_validation_error
source: Start time must be before end time.
kk: Басталу уақыты аяқталу уақытынан бұрын болуы керек
ru: Время начала должно быть раньше времени окончания

# schedule_date_validation_error
source: Training date cannot be in the past.
kk: Жаттығу күні өткенде болуы мүмкін емес
ru: Дата тренировки не может быть в прошлом

# reschedule_time_validation_error
source: Reschedule end time must be after reschedule start time.
kk: Ауыстыру аяқталу уақыты ауыстыру басталу уақытынан кейін болуы керек
ru: Время окончания переноса должно быть после времени начала переноса

# schedule_conflict_error
source: Schedule conflicts with existing training session.
kk: Кесте қолданыстағы жаттығумен қақтығысады
ru: Расписание конфликтует с существующей тренировкой

# schedule_cannot_update_finished
source: Cannot update finished training session.
kk: Аяқталған жаттығуды жаңарту мүмкін емес
ru: Невозможно обновить завершенную тренировку

# schedule_cannot_cancel_finished
source: Cannot cancel finished training session.
kk: Аяқталған жаттығуды болдырмау мүмкін емес
ru: Невозможно отменить завершенную тренировку

# schedule_already_started
source: Cannot modify schedule. Training has already started.
kk: Кестені өзгерту мүмкін емес. Жаттығу басталды
ru: Невозможно изменить расписание. Тренировка уже началась

# academy_gallery_not_found
source: Academy gallery image not found.
kk: Академия галереясының суреті табылмады
ru: Изображение галереи академии не найдено

# academy_gallery_id_validation_error
source: Academy gallery image ID must be a positive number.
kk: Академия галереясы суретінің ID-сы оң сан болуы керек
ru: ID изображения галереи академии должен быть положительным числом

# academy_gallery_file_required
source: File is required for gallery image.
kk: Галерея суреті үшін файл міндетті
ru: Файл обязателен для изображения галереи

# academy_gallery_duplicate_file
source: This file is already in the academy gallery.
kk: Бұл файл академия галереясында қазірдің өзінде бар
ru: Этот файл уже есть в галерее академии

# academy_gallery_invalid_file_type
source: Only image files are allowed in academy gallery.
kk: Академия галереясында тек сурет файлдарына рұқсат етіледі
ru: В галерее академии разрешены только файлы изображений

source: Cart not found.
kk: Себет табылмады
ru: Корзина не найдена

# cart_id_validation_error
source: Cart ID must be a positive number.
kk: Себет ID-сы оң сан болуы керек
ru: ID корзины должен быть положительным числом

# cart_user_mismatch
source: Cart does not belong to this user.
kk: Себет бұл пайдаланушыға тиесілі емес
ru: Корзина не принадлежит этому пользователю

# cart_already_exists
source: User already has an active cart.
kk: Пайдаланушыда қазірдің өзінде белсенді себет бар
ru: У пользователя уже есть активная корзина

# cart_total_calculation_error
source: Error calculating cart total price.
kk: Себет жалпы құнын есептеу қатесі
ru: Ошибка расчета общей стоимости корзины

# cart_items_invalid_format
source: Cart items must be in valid JSON format.
kk: Себет тауарлары JSON форматында болуы керек
ru: Товары корзины должны быть в формате JSON

# cart_empty_error
source: Cannot process empty cart.
kk: Бос себетті өңдеу мүмкін емес
ru: Невозможно обработать пустую корзину

source: Cart item not found.
kk: Себеттегі тауар табылмады
ru: Товар в корзине не найден

# cart_item_id_validation_error
source: Cart item ID must be a positive number.
kk: Себеттегі тауар ID-сы оң сан болуы керек
ru: ID товара в корзине должен быть положительным числом

# cart_item_quantity_invalid
source: Cart item quantity must be a positive number.
kk: Тауар саны оң сан болуы керек
ru: Количество товара должно быть положительным числом

# cart_item_price_invalid
source: Cart item price cannot be negative.
kk: Тауар бағасы теріс болуы мүмкін емес
ru: Цена товара не может быть отрицательной

# cart_item_duplicate
source: This product variant is already in the cart.
kk: Бұл тауар нұсқасы себетте қазірдің өзінде бар
ru: Этот вариант товара уже есть в корзине

source: Product not found.
kk: Тауар табылмады
ru: Товар не найден

source: Product variant not found.
kk: Тауар нұсқасы табылмады
ru: Вариант товара не найден

# cart_item_calculation_error
source: Error calculating cart item prices.
kk: Себеттегі тауар бағаларын есептеу қатесі
ru: Ошибка расчета цен товара в корзине

# user_id_validation_error
source: User ID must be a positive number
kk: Пайдаланушы ID-сы оң сан болуы керек

# product_id_validation_error
source: Product ID must be a positive number
kk: Өнім ID-сы оң сан болуы керек

# variant_id_validation_error
source: Variant ID must be a positive number
kk: Вариант ID-сы оң сан болуы керек

# product_variant_mismatch
source: Variant does not belong to the specified product
kk: Вариант көрсетілген өнімге жатпайды

source: Product category not found by ID
kk: Өнім санаты ID-мен табылмады

# category_modification_already_exists
source: Modification for this category already exists
kk: Бұл санат үшін модификация әлдеқашан бар

source: Permission not found
kk: Рұқсат табылмады

source: SKU already exists
kk: SKU әлдеқашан бар

source: City not found by ID
kk: Қала ID-мен табылмады

source: Category not found by ID
kk: Санат ID-мен табылмады

source: Product variant not found by ID
kk: Өнім нұсқасы ID-мен табылмады

# product_variant_does_not_belong_to_product
source: Variant does not belong to this product
kk: Нұсқа осы өнімге жатпайды

source: File not found by ID
kk: Файл ID-мен табылмады

# either_file_id_or_file_required
source: Either file ID or file is required
kk: Файл ID-сы немесе файлдың өзі қажет

source: Modification value not found by ID
kk: Модификация мәні ID-мен табылмады

# product_variant_modification_already_exists
source: Modification for this product variant already exists
kk: Бұл өнім нұсқасы үшін модификация әлдеқашан бар

source: Request material not found
kk: Сұраныс материалы табылмады

source: User not found by ID
kk: Пайдаланушы ID-мен табылмады

source: Invalid request status
kk: Сұраныс мәртебесі жарамсыз

# cannot_reset_checked_request_without_removing_checker
source: Cannot reset status of checked request without removing checker
kk: Тексерушіні жоймай тексерілген сұраныстың мәртебесін нөлдеу мүмкін емес
